JonathanCoco/User_III/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @Users = User.all()

INSERT INTO "users" ("first_name", "last_name", "email_address", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "test"], ["last_name", "test"], ["email_address", "test@test.com"], ["password", "test"], ["created_at", "2016-12-05 18:51:51.877178"], ["updated_at", "2016-12-05 18:51:51.877178"]]
---
  def create
    bError = false

    flash[:first_name] = ""
    flash[:last_name] = ""
    flash[:email_address] = ""

    @user  = User.new
    @value = ""

    @user.first_name = params[:first_name]
    @user.last_name = params[:last_name]
    @user.email_address = params[:email_address]
    @user.password = params[:password]

    if @user.save()

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 14]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 14]]
---
    def destroy

      user  = User.find(params[:id])

      user.destroy()

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "email_address" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email_address", "julie@ryan.com"], ["updated_at", "2016-12-05 19:03:22.382260"], ["id", 16]]
---
  def update

    flash[:first_name] = ""
    flash[:last_name] = ""
    flash[:email_address] = ""

    @user = User.find(params[:id])

    @user.first_name = params[:first_name]
    @user.last_name = params[:last_name]
    @user.email_address = params[:email_address]
    @user.password = params[:password]


    if @user.save()