JonathanCoco/product_dashboard_i/app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @products  = Product.all()

SELECT "categories".* FROM "categories"
---
  def new
    @product  = Product.new
    @categories = Category.all()

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT "categories".* FROM "categories"
---
  def edit
    @product = Product.find(params[:id])
    @categories = Category.all()

INSERT INTO "products" ("name", "description", "pricing", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "tname"], ["description", "tdesc"], ["pricing", 100.0], ["category_id", 3], ["created_at", "2016-12-05 22:36:20.373377"], ["updated_at", "2016-12-05 22:36:20.373377"]]
---
  def create
    flash[:name] = ""
    flash[:description] = ""
    flash[:pricing] = ""

    @product  = Product.new(product_params)

    #@product.name = params[:name]
    #@product.description = params[:description]
    #@product.pricing = params[:pricing]

    if @product.save()

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "description" = ?, "pricing" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["description", "desc"], ["pricing", 100.0], ["updated_at", "2016-12-05 21:35:46.217264"], ["id", 13]]
---
  def update
    flash[:name] = ""
    flash[:description] = ""
    flash[:pricing] = ""

    @product = Product.find(params[:id])

    if (@product.update(product_params))

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 2]]
---
  def destroy
    product = Product.find(params[:id])

    product.destroy()