JonathanCoco/RCModeltest/app/controllers/users_controller.rb

    def index

        @Users = User.all()
---
SELECT "users".* FROM "users"

    def create

        user  = User.new
        #user.name = Faker::Name.name
        user.name = params[:name]

        user.save()
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "jonathancoco"], ["created_at", "2016-12-02 21:05:05.311515"], ["updated_at", "2016-12-02 21:05:05.311515"]]

    def update

        @user  =  User.find(params[:id])
        @user.name = params[:name]
        @user.save()
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 9]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Pauline Franecki Crazy"], ["updated_at", "2016-12-03 21:14:19.533531"], ["id", 9]]

    def destroy

        @user  =  User.find(params[:id])
        @user.destroy()
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]

    def total
        @total = User.all().count()
---
SELECT COUNT(*) FROM "users"