Monet/ControllersViews/inegratingModelswithController/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Bob"], ["created_at", "2016-12-05 21:22:47.820913"], ["updated_at", "2016-12-05 21:22:47.820913"]]
---
  def create
  	User.create(name:Faker::Name.name)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
  	session[:id] = params[:id]
  	session[:name] = User.find(params[:id]).name

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Bob"], ["updated_at", "2016-12-05 23:22:23.610350"], ["id", 1]]
---
  def update
  	id = params[:id]
  	the_name = params[:name]
  	User.find(id).update(name:the_name)

SELECT COUNT(*) FROM "users"
---
  def total
  	render text: "There are #{User.count} users"