JonathanCoco/product_dashboard_ii/app/controllers/comments_controller.rb

INSERT INTO "comments" ("comment", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["comment", "test comment"], ["product_id", 15], ["created_at", "2016-12-05 23:21:30.903776"], ["updated_at", "2016-12-05 23:21:30.903776"]]
---
  def create
    @comment  = Comment.new(comment_params)

    if @comment.save()