JonathanCoco/product_dashboard_ii/app/views/products/show.html.erb


<% @product.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 15]]