Basim_Muhammad/Assignments/integrating/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "rando\#{@count}"], ["created_at", "2016-12-05 20:58:30.756749"], ["updated_at", "2016-12-05 20:58:30.756749"]]
---
	def create
		@count = 0
		User.create(name:"rando #{@count}")

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
---
	def show
		render json: User.find(1)

SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
---
	def edit
		@user=User.first.name

SELECT "users".* FROM "users"
---
	def total
		@count=0
		User.all.each{|data| @count+=1}