Basim_Muhammad/Assignments/form/app/controllers/users_controller.rb

	def create
		session[:new_user]=User.create(name:params['name'],location:params['location'],language:params['language'],comment: params['comment'])
---
INSERT INTO "users" ("name", "location", "language", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "rjy"], ["location", "DC"], ["language", "C"], ["comment", "hgmmhgc"], ["created_at", "2016-12-06 02:38:10.579228"], ["updated_at", "2016-12-06 02:38:10.579228"]]